print('Задача 4. Успеваемость в классе')

# В классе N человек.
# Каждый из них получил за урок по информатике оценку: 3, 4 или 5, двоек сегодня не было.
#
# Напишите программу,
# которая получает список оценок - N чисел - и выводит на экран сообщение о том,
# кого сегодня больше: отличников, хорошистов или троечников.

# Замечание: можно предположить, что количество отличников, хорошистов, троечников различно.

pupils = int(input('Введите колличество учеников: '))
nice = 0
good = 0
so_so = 0

for marks in range(o, pupils):
    mark = int(input('Введите оценку'))
    if mark = 5:
        nice += 1
    if mark = 4:
        good += 1
    if mark = 3:
        so_so += 1
if nice good so_so
if good nice so_so
if so_so